; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person city flevel - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (nxt ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1)
		 (nxt ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (nxt ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-5-25)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl6)
	(at plane2 city6)
	(fuel-level plane2 fl0)
	(at plane3 city18)
	(fuel-level plane3 fl0)
	(at plane4 city11)
	(fuel-level plane4 fl6)
	(at plane5 city9)
	(fuel-level plane5 fl4)
	(at person1 city12)
	(at person2 city13)
	(at person3 city12)
	(at person4 city1)
	(at person5 city20)
	(at person6 city13)
	(at person7 city13)
	(at person8 city4)
	(at person9 city7)
	(at person10 city7)
	(at person11 city8)
	(at person12 city14)
	(at person13 city1)
	(at person14 city14)
	(at person15 city2)
	(at person16 city21)
	(at person17 city8)
	(at person18 city4)
	(at person19 city8)
	(at person20 city17)
	(at person21 city5)
	(at person22 city21)
	(at person23 city15)
	(at person24 city6)
	(at person25 city5)
	(nxt fl0 fl1)
	(nxt fl1 fl2)
	(nxt fl2 fl3)
	(nxt fl3 fl4)
	(nxt fl4 fl5)
	(nxt fl5 fl6)
)
(:goal (and
	(at person1 city5)
	(at person2 city0)
	(at person3 city18)
	(at person4 city7)
	(at person5 city8)
	(at person6 city4)
	(at person7 city12)
	(at person8 city16)
	(at person9 city20)
	(at person10 city5)
	(at person11 city18)
	(at person12 city10)
	(at person13 city0)
	(at person14 city1)
	(at person15 city0)
	(at person16 city13)
	(at person17 city4)
	(at person18 city9)
	(at person19 city16)
	(at person20 city1)
	(at person21 city10)
	(at person22 city2)
	(at person23 city4)
	(at person24 city18)
	(at person25 city21)
	))

)

; plan
1. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 0 of 25
2. (board person24 plane2 city6)
   deleted: (at person24 city6)
   added: (in person24 plane2)
   goals met: 0 of 25
3. (fly plane1 city0 city2 fl6 fl5)
   deleted: (at plane1 city0) (fuel-level plane1 fl6)
   added: (at plane1 city2) (fuel-level plane1 fl5)
   goals met: 0 of 25
4. (board person15 plane1 city2)
   deleted: (at person15 city2)
   added: (in person15 plane1)
   goals met: 0 of 25
5. (fly plane2 city6 city18 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 0 of 25
6. (debark person24 plane2 city18)
   deleted: (in person24 plane2)
   added: (at person24 city18)
   goals met: 1 of 25
7. (fly plane5 city9 city14 fl4 fl3)
   deleted: (at plane5 city9) (fuel-level plane5 fl4)
   added: (at plane5 city14) (fuel-level plane5 fl3)
   goals met: 1 of 25
8. (board person12 plane5 city14)
   deleted: (at person12 city14)
   added: (in person12 plane5)
   goals met: 1 of 25
9. (board person14 plane5 city14)
   deleted: (at person14 city14)
   added: (in person14 plane5)
   goals met: 1 of 25
10. (fly plane5 city14 city17 fl3 fl2)
   deleted: (at plane5 city14) (fuel-level plane5 fl3)
   added: (at plane5 city17) (fuel-level plane5 fl2)
   goals met: 1 of 25
11. (board person20 plane5 city17)
   deleted: (at person20 city17)
   added: (in person20 plane5)
   goals met: 1 of 25
12. (fly plane5 city17 city15 fl2 fl1)
   deleted: (at plane5 city17) (fuel-level plane5 fl2)
   added: (at plane5 city15) (fuel-level plane5 fl1)
   goals met: 1 of 25
13. (board person23 plane5 city15)
   deleted: (at person23 city15)
   added: (in person23 plane5)
   goals met: 1 of 25
14. (fly plane1 city2 city0 fl5 fl4)
   deleted: (at plane1 city2) (fuel-level plane1 fl5)
   added: (at plane1 city0) (fuel-level plane1 fl4)
   goals met: 1 of 25
15. (debark person15 plane1 city0)
   deleted: (in person15 plane1)
   added: (at person15 city0)
   goals met: 2 of 25
16. (zoom plane1 city0 city13 fl4 fl3 fl2)
   deleted: (at plane1 city0) (fuel-level plane1 fl4)
   added: (at plane1 city13) (fuel-level plane1 fl2)
   goals met: 2 of 25
17. (zoom plane1 city13 city21 fl2 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl2)
   added: (at plane1 city21) (fuel-level plane1 fl0)
   goals met: 2 of 25
18. (fly plane5 city15 city1 fl1 fl0)
   deleted: (at plane5 city15) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 2 of 25
19. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 2 of 25
20. (board person4 plane5 city1)
   deleted: (at person4 city1)
   added: (in person4 plane5)
   goals met: 2 of 25
21. (board person13 plane5 city1)
   deleted: (at person13 city1)
   added: (in person13 plane5)
   goals met: 2 of 25
22. (debark person14 plane5 city1)
   deleted: (in person14 plane5)
   added: (at person14 city1)
   goals met: 3 of 25
23. (debark person20 plane5 city1)
   deleted: (in person20 plane5)
   added: (at person20 city1)
   goals met: 4 of 25
24. (fly plane5 city1 city7 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 4 of 25
25. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 4 of 25
26. (board person9 plane5 city7)
   deleted: (at person9 city7)
   added: (in person9 plane5)
   goals met: 4 of 25
27. (board person10 plane5 city7)
   deleted: (at person10 city7)
   added: (in person10 plane5)
   goals met: 4 of 25
28. (debark person4 plane5 city7)
   deleted: (in person4 plane5)
   added: (at person4 city7)
   goals met: 5 of 25
29. (fly plane5 city7 city20 fl1 fl0)
   deleted: (at plane5 city7) (fuel-level plane5 fl1)
   added: (at plane5 city20) (fuel-level plane5 fl0)
   goals met: 5 of 25
30. (refuel plane5 city20 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 5 of 25
31. (board person5 plane5 city20)
   deleted: (at person5 city20)
   added: (in person5 plane5)
   goals met: 5 of 25
32. (debark person9 plane5 city20)
   deleted: (in person9 plane5)
   added: (at person9 city20)
   goals met: 6 of 25
33. (fly plane5 city20 city8 fl1 fl0)
   deleted: (at plane5 city20) (fuel-level plane5 fl1)
   added: (at plane5 city8) (fuel-level plane5 fl0)
   goals met: 6 of 25
34. (refuel plane5 city8 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 6 of 25
35. (board person11 plane5 city8)
   deleted: (at person11 city8)
   added: (in person11 plane5)
   goals met: 6 of 25
36. (board person17 plane5 city8)
   deleted: (at person17 city8)
   added: (in person17 plane5)
   goals met: 6 of 25
37. (board person19 plane5 city8)
   deleted: (at person19 city8)
   added: (in person19 plane5)
   goals met: 6 of 25
38. (debark person5 plane5 city8)
   deleted: (in person5 plane5)
   added: (at person5 city8)
   goals met: 7 of 25
39. (fly plane5 city8 city5 fl1 fl0)
   deleted: (at plane5 city8) (fuel-level plane5 fl1)
   added: (at plane5 city5) (fuel-level plane5 fl0)
   goals met: 7 of 25
40. (refuel plane5 city5 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 7 of 25
41. (board person21 plane5 city5)
   deleted: (at person21 city5)
   added: (in person21 plane5)
   goals met: 7 of 25
42. (board person25 plane5 city5)
   deleted: (at person25 city5)
   added: (in person25 plane5)
   goals met: 7 of 25
43. (debark person10 plane5 city5)
   deleted: (in person10 plane5)
   added: (at person10 city5)
   goals met: 8 of 25
44. (fly plane5 city5 city10 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 8 of 25
45. (refuel plane5 city10 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 8 of 25
46. (debark person12 plane5 city10)
   deleted: (in person12 plane5)
   added: (at person12 city10)
   goals met: 9 of 25
47. (debark person21 plane5 city10)
   deleted: (in person21 plane5)
   added: (at person21 city10)
   goals met: 10 of 25
48. (fly plane5 city10 city21 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city21) (fuel-level plane5 fl0)
   goals met: 10 of 25
49. (refuel plane5 city21 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 25
50. (board person16 plane5 city21)
   deleted: (at person16 city21)
   added: (in person16 plane5)
   goals met: 10 of 25
51. (board person22 plane5 city21)
   deleted: (at person22 city21)
   added: (in person22 plane5)
   goals met: 10 of 25
52. (debark person25 plane5 city21)
   deleted: (in person25 plane5)
   added: (at person25 city21)
   goals met: 11 of 25
53. (fly plane5 city21 city13 fl1 fl0)
   deleted: (at plane5 city21) (fuel-level plane5 fl1)
   added: (at plane5 city13) (fuel-level plane5 fl0)
   goals met: 11 of 25
54. (refuel plane5 city13 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 11 of 25
55. (board person2 plane5 city13)
   deleted: (at person2 city13)
   added: (in person2 plane5)
   goals met: 11 of 25
56. (board person6 plane5 city13)
   deleted: (at person6 city13)
   added: (in person6 plane5)
   goals met: 11 of 25
57. (board person7 plane5 city13)
   deleted: (at person7 city13)
   added: (in person7 plane5)
   goals met: 11 of 25
58. (debark person16 plane5 city13)
   deleted: (in person16 plane5)
   added: (at person16 city13)
   goals met: 12 of 25
59. (fly plane5 city13 city12 fl1 fl0)
   deleted: (at plane5 city13) (fuel-level plane5 fl1)
   added: (at plane5 city12) (fuel-level plane5 fl0)
   goals met: 12 of 25
60. (refuel plane5 city12 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 12 of 25
61. (board person1 plane5 city12)
   deleted: (at person1 city12)
   added: (in person1 plane5)
   goals met: 12 of 25
62. (board person3 plane5 city12)
   deleted: (at person3 city12)
   added: (in person3 plane5)
   goals met: 12 of 25
63. (debark person7 plane5 city12)
   deleted: (in person7 plane5)
   added: (at person7 city12)
   goals met: 13 of 25
64. (fly plane5 city12 city5 fl1 fl0)
   deleted: (at plane5 city12) (fuel-level plane5 fl1)
   added: (at plane5 city5) (fuel-level plane5 fl0)
   goals met: 13 of 25
65. (refuel plane5 city5 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 13 of 25
66. (debark person1 plane5 city5)
   deleted: (in person1 plane5)
   added: (at person1 city5)
   goals met: 14 of 25
67. (fly plane5 city5 city18 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl1)
   added: (at plane5 city18) (fuel-level plane5 fl0)
   goals met: 14 of 25
68. (refuel plane5 city18 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 14 of 25
69. (debark person3 plane5 city18)
   deleted: (in person3 plane5)
   added: (at person3 city18)
   goals met: 15 of 25
70. (debark person11 plane5 city18)
   deleted: (in person11 plane5)
   added: (at person11 city18)
   goals met: 16 of 25
71. (fly plane5 city18 city0 fl1 fl0)
   deleted: (at plane5 city18) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 16 of 25
72. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 25
73. (debark person2 plane5 city0)
   deleted: (in person2 plane5)
   added: (at person2 city0)
   goals met: 17 of 25
74. (debark person13 plane5 city0)
   deleted: (in person13 plane5)
   added: (at person13 city0)
   goals met: 18 of 25
75. (fly plane5 city0 city2 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 18 of 25
76. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 25
77. (debark person22 plane5 city2)
   deleted: (in person22 plane5)
   added: (at person22 city2)
   goals met: 19 of 25
78. (fly plane5 city2 city4 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 19 of 25
79. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 19 of 25
80. (board person8 plane5 city4)
   deleted: (at person8 city4)
   added: (in person8 plane5)
   goals met: 19 of 25
81. (board person18 plane5 city4)
   deleted: (at person18 city4)
   added: (in person18 plane5)
   goals met: 19 of 25
82. (debark person6 plane5 city4)
   deleted: (in person6 plane5)
   added: (at person6 city4)
   goals met: 20 of 25
83. (debark person17 plane5 city4)
   deleted: (in person17 plane5)
   added: (at person17 city4)
   goals met: 21 of 25
84. (debark person23 plane5 city4)
   deleted: (in person23 plane5)
   added: (at person23 city4)
   goals met: 22 of 25
85. (fly plane5 city4 city9 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 22 of 25
86. (refuel plane5 city9 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 22 of 25
87. (debark person18 plane5 city9)
   deleted: (in person18 plane5)
   added: (at person18 city9)
   goals met: 23 of 25
88. (fly plane5 city9 city16 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl1)
   added: (at plane5 city16) (fuel-level plane5 fl0)
   goals met: 23 of 25
89. (debark person8 plane5 city16)
   deleted: (in person8 plane5)
   added: (at person8 city16)
   goals met: 24 of 25
90. (debark person19 plane5 city16)
   deleted: (in person19 plane5)
   added: (at person19 city16)
   goals met: 25 of 25
